app/Models/UsuariosModel.php

    public function getUsuarios()
    {
        return $this->findAll();
---
SELECT *
FROM `usuarios`